<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe is based on com.github.autopkg.munki.munkitools5 and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.override.munkitools5</string>
 	<key>Input</key>
	<dict>
		<key>INCLUDE_PRERELEASES</key>
		<string></string>
		<key>NAME</key>
        <string>app_munki</string>
		<key>MUNKI_CATALOG</key>
        <string>generic</string>
		<key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
		<key>MUNKI_DEVELOPER</key>
		<string>The Munki Project</string>
		<key>MUNKI_ICON</key>
        <string>app_munkitools</string>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/munki</string>
        <!--  -->
		<key>MUNKITOOLS_CORE_NAME</key>
        <string>app_munkitools_core</string>
		<key>MUNKITOOLS_CORE_DISPLAYNAME</key>
		<string>Managed Software Center core tools</string>
		<key>MUNKITOOLS_CORE_DESCRIPTION</key>
		<string>Core command-line tools used by Managed Software Center.</string>
        <!--  -->
		<key>MUNKITOOLS_ADMIN_NAME</key>
        <string>app_munkitools_admin</string>
		<key>MUNKITOOLS_ADMIN_DISPLAYNAME</key>
		<string>Managed Software Center admin tools</string>
		<key>MUNKITOOLS_ADMIN_DESCRIPTION</key>
		<string>Command-line Managed Software Center admin tools.</string>
        <!--  -->
		<key>MUNKITOOLS_APP_NAME</key>
        <string>app_munkitools</string>
		<key>MUNKITOOLS_APP_DISPLAYNAME</key>
		<string>Managed Software Center</string>
		<key>MUNKITOOLS_APP_DESCRIPTION</key>
		<string>Managed Software Center application.</string>
        <!--  -->
		<key>MUNKITOOLS_APP_USAGE_NAME</key>
        <string>app_munkitools_app_usage</string>
		<key>MUNKITOOLS_APP_USAGE_DISPLAYNAME</key>
		<string>Managed Software Center app usage</string>
		<key>MUNKITOOLS_APP_USAGE_DESCRIPTION</key>
		<string>Application usage statistics for Managed Software Center.</string>
        <!--  -->
		<key>MUNKITOOLS_LAUNCHD_NAME</key>
        <string>app_munkitools_launchd</string>
		<key>MUNKITOOLS_LAUNCHD_DISPLAYNAME</key>
		<string>Managed Software Center launchd files</string>
		<key>MUNKITOOLS_LAUNCHD_DESCRIPTION</key>
		<string>launchd configuration files for use by Managed Software Center.</string>
        <!--  -->
		<key>MUNKITOOLS_PYTHON_NAME</key>
        <string>app_munkitools_python</string>
		<key>MUNKITOOLS_PYTHON_DISPLAYNAME</key>
		<string>Managed Software Center embedded python</string>
		<key>MUNKITOOLS_PYTHON_DESCRIPTION</key>
		<string>Embedded Python tools used by Managed Software Center.</string>
		<key>localized_strings</key>
		<dict>
			<key>fallback_locale</key>
			<string>en</string>
			<key>de</key>
			<dict>
				<key>category</key>
				<string>Dienstprogramme</string>
				<key>MUNKITOOLS_CORE_DESCRIPTION</key>
				<string>Gemeinsame Befehlszeilentools für die Geführte Softwareaktualisierung</string>
				<key>MUNKITOOLS_CORE_DISPLAYNAME</key>
				<string>Geführte Softwareaktualisierung – Basis-Komponenten</string>
				<key>MUNKITOOLS_ADMIN_DESCRIPTION</key>
				<string>Admin-Tools für die Geführte Softwareaktualisierung. Diese Tools sind nicht zwingend für den Betrieb erforderlich, ermöglichen aber weitergehende administrative Aufgaben vom Client-Rechner aus.</string>
				<key>MUNKITOOLS_ADMIN_DISPLAYNAME</key>
				<string>Geführte Softwareaktualisierung: Admin-Tools</string>
				<key>MUNKITOOLS_APP_DESCRIPTION</key>
				<string>Die Benutzeroberfläche für die Geführte Softwareaktualisierung.</string>
				<key>MUNKITOOLS_APP_DISPLAYNAME</key>
				<string>Geführte Softwareaktualisierung</string>
				<key>MUNKITOOLS_APP_USAGE_DESCRIPTION</key>
				<string>Erfassung von Statistiken über die Nutzung der Geführten Softwareaktualisierung.</string>
				<key>MUNKITOOLS_APP_USAGE_DISPLAYNAME</key>
				<string>Geführte Softwareaktualisierung: Nutzungs-Statistiken</string>
				<key>MUNKITOOLS_LAUNCHD_DESCRIPTION</key>
				<string>Skripte für die automatische Ausführung der geführten Softwareaktualisierung.</string>
				<key>MUNKITOOLS_LAUNCHD_DISPLAYNAME</key>
				<string>Geführte Softwareaktualisierung - Autostart-Skripte</string>
				<key>MUNKITOOLS_PYTHON_DESCRIPTION</key>
				<string>Eigene von Apple unabhängige Python-Version der geführten Softwareaktualisierung.</string>
				<key>MUNKITOOLS_PYTHON_DISPLAYNAME</key>
				<string>Geführte Softwareaktualisierung - Python-Tools</string>
			</dict>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.munkitools5</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.munki.munkitools5</key>
			<dict>
				<key>git_hash</key>
				<string>ce0b23bd6a57de0c2550853ccb06fc6a932f0da4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/munkitools/munkitools5.munki.recipe</string>
				<key>sha256_hash</key>
				<string>573c275d886e6169fdb62d51bab0c6675251b32a5a9e8c40b27a55177c1c685f</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
