<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Egnyte Drive package and imports into Munki.

	This recipe is based on com.github.dataJAR-recipes.nunki.EgnyteDrive and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.EgnyteDrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_egnyte_drive</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/egnyte</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Egnyte Connect (formerly Egnyte Drive) is a service synchronizing files with the cloud.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Egnyte Connect (ehemals Egnyte Drive) ist ein Dienst, der Daten in die Cloud synchronisiert.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Egnyte</string>
			<key>display_name</key>
			<string>Egnyte Drive</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.nunki.EgnyteDrive</string>
</dict>
</plist>
