<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports latest version of Viscosity into a Munki repo.

	This recipe is based on com.github.jessepeterson.Viscosity.munki and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.viscosity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_viscosity</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/sparklabs</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Viscosity is a first class OpenVPN client that lets you secure your network with ease &amp; style.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Viscosity ist ein erstklassiger OpenVPN-Client, der dich dein Netzwerk elegant und einfach absichern lässt.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>SparkLabs</string>
			<key>display_name</key>
			<string>Viscosity</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.Viscosity.munki</string>
</dict>
</plist>
