<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Pragli and imports it into Munki.

This recipe is based on com.github.wycomco.munki.Pragli and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.Pragli</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/pragli</string>
		<key>NAME</key>
		<string>app_pragli</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Virtual office for remote teams</string>
			<key>developer</key>
			<string>Vivek Nair</string>
			<key>display_name</key>
			<string>Pragli</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Soziale Netze</string>
					<key>description</key>
					<string>Virtuelles Büro im Home-Office</string>
				</dict>
			</dict>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.munki.Pragli</string>
</dict>
</plist>
