<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Parallels Desktop and imports it into Munki. This recipe has been tested with major versions 9 through 16.

    For major versions 9 through 15, leave the PLATFORM_ARCH blank in your override.

	This recipe is based on com.github.homebysix.munki.ParallelsDesktop and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.ParallelsDesktop15</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>15</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/parallels/%NAME%</string>
		<key>NAME</key>
		<string>app_parallelsdesktop15</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Virtualization tool for running Windows apps without rebooting.</string>
			<key>developer</key>
			<string>Parallels, Inc.</string>
			<key>display_name</key>
			<string>Parallels Desktop 15</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Virtualisierungswerkzeug zum Ausführen von Windows-Anwendungen ohne Neustart.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
			<key>minimum_os_version</key>
			<string>10.12</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
chflags nohidden "/Applications/Parallels Desktop.app"
            </string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.ParallelsDesktop</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.ParallelsDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>5a91270a93dd9f0600fea752e5d23754115e1bcc</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Parallels/ParallelsDesktop.download.recipe</string>
				<key>sha256_hash</key>
				<string>0cb03def3c6eb5c9444dc68dd49745ad1be22530d5537ffe2ac163385e2c9401</string>
			</dict>
			<key>com.github.homebysix.munki.ParallelsDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>5a91270a93dd9f0600fea752e5d23754115e1bcc</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Parallels/ParallelsDesktop.munki.recipe</string>
				<key>sha256_hash</key>
				<string>876f1d531e6edbacf8da71151af96ee8e2abf52e9740b8fc6b5e0bf1be234156</string>
			</dict>
			<key>com.github.homebysix.pkg.ParallelsDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>5a91270a93dd9f0600fea752e5d23754115e1bcc</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Parallels/ParallelsDesktop.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>a3b2bba232163a303ae229681edc86e26da84f999642bf8966344c20e62a3077</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
