<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GoToMeeting and imports it into Munki.

This recipe is based on com.github.homebysix.munki.GoToMeeting and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.
A postinstall_script which creates a symlink to the latest version of GoToMeeting has been added as well.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.gotomeeting</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/gotomeeting</string>
		<key>NAME</key>
		<string>GoToMeeting</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Online meeting, desktop sharing, and video conferencing software.</string>
			<key>developer</key>
			<string>Citrix Systems, Inc.</string>
			<key>display_name</key>
			<string>GoToMeeting</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Software für Onlinemeetings, Desktop Sharing und Videokonferenzen.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
			<key>name</key>
			<string>app_gotomeeting</string>
			<key>preinstall_script</key>
			<string>#!/bin/bash

echo "Removing old copies of GoToMeeting from the /Applications folder..."

rm -rf /Applications/GoToMeeting\ \(*\).app

if [[ -d "/Applications/GoToMeeting" ]]; then
    rm -rf "/Applications/GoToMeeting"
fi

if [[ -f "/Applications/GoToMeeting.app/Contents/Info.plist" ]]; then
    rm -rf "/Applications/GoToMeeting.app"
fi

exit 0
            </string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.GoToMeeting</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>GoToMeetingURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>5167bdbd83ceacab1a0d7862ecc42e35ecdb7c17</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GoToMeeting/GoToMeetingURLProvider.py</string>
				<key>sha256_hash</key>
				<string>4548dc2a392545608570eeaee42630592dacd88d1f397e1413cf70e307c2a8cd</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.GoToMeeting</key>
			<dict>
				<key>git_hash</key>
				<string>1b8b9c15f3a3e92de5e7e5a54a6a2e44431832d6</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GoToMeeting/GoToMeeting.download.recipe</string>
				<key>sha256_hash</key>
				<string>cee386c288a54a18d3255bbc6fe6fc5a0c475309f2276f9c2c3318b43a338614</string>
			</dict>
			<key>com.github.homebysix.munki.GoToMeeting</key>
			<dict>
				<key>git_hash</key>
				<string>1b8b9c15f3a3e92de5e7e5a54a6a2e44431832d6</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/GoToMeeting/GoToMeeting.munki.recipe</string>
				<key>sha256_hash</key>
				<string>2b762c086d57cc974ca2a80db6d4114ef9b1d836baaefc24ef0805e7263656c3</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>postinstall_script</key>
					<string>#!/bin/bash
NAME="%NAME%"
build="%build%"

rm -rf "$3/Applications/GoToMeeting.app"
ln -s "$3/Applications/$NAME ($build).app" "$3/Applications/GoToMeeting.app"
</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
	</array>
</dict>
</plist>
