<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GoToMeeting and imports it into Munki.

This recipe is based on com.github.homebysix.munki.GoToMeeting and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.
A postinstall_script which creates a symlink to the latest version of GoToMeeting has been added as well.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.gotomeeting</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/gotomeeting</string>
		<key>NAME</key>
		<string>GoToMeeting</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Online meeting, desktop sharing, and video conferencing software.</string>
			<key>developer</key>
			<string>LogMeIn</string>
			<key>display_name</key>
			<string>GoToMeeting</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Software für Onlinemeetings, Desktop Sharing und Videokonferenzen.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
			<key>name</key>
			<string>app_gotomeeting</string>
			<key>preinstall_script</key>
			<string>#!/bin/bash

echo "Removing old copies of GoToMeeting from the /Applications folder..."

rm -rf /Applications/GoToMeeting\ \(*\).app

if [[ -d "/Applications/GoToMeeting" ]]; then
    rm -rf "/Applications/GoToMeeting"
fi

if [[ -f "/Applications/GoToMeeting.app/Contents/Info.plist" ]]; then
    rm -rf "/Applications/GoToMeeting.app"
fi

exit 0
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.GoToMeeting</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
			<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
 			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>postinstall_script</key>
					<string>#!/bin/bash
NAME="%NAME%"
build="%build%"

rm -rf "$3/Applications/GoToMeeting.app"
ln -s "$3/Applications/$NAME ($build).app" "$3/Applications/GoToMeeting.app"
</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
