<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Suspicious Package and imports it into Munki. This recipe is based on com.github.poundbangbash.eholtam-recipes.munki.SuspiciousPackageApp and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.SuspiciousPackageApp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SuspiciousPackageApp</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Suspicious Package: An Application for Inspecting OS X Installer Packages</string>
			<key>display_name</key>
			<string>Suspicious Package App</string>
			<key>developer</key>
			<string>Mothers Ruin Software</string>
			<key>category</key>
			<string>Utilities</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Dienstprogramme</string>
					<key>description</key>
					<string>Eine Anwendung zur Inspektion von macOS-Installer-Paketen</string>
				</dict>
			</dict>
			<key>minimum_os_version</key>
			<string>10.14</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
		<key>repo_subdirectory</key>
		<string>generic/apps/suspiciouspackage</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.poundbangbash.eholtam-recipes.munki.SuspiciousPackageApp</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.poundbangbash.eholtam-recipes.download.SuspiciousPackageApp</key>
			<dict>
				<key>git_hash</key>
				<string>865ba08bc02a966f3b9313c2635736e2cc625648</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.eholtam-recipes/SuspiciousPackageApp/SuspiciousPackageApp.download.recipe</string>
				<key>sha256_hash</key>
				<string>2921d0eaffa7b853f673f59c81e9632674501e5512da30ca4e2944c8705ab359</string>
			</dict>
			<key>com.github.poundbangbash.eholtam-recipes.munki.SuspiciousPackageApp</key>
			<dict>
				<key>git_hash</key>
				<string>f25420719e664b37aa0977382b542c54b87ff574</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.eholtam-recipes/SuspiciousPackageApp/SuspiciousPackageApp.munki.recipe</string>
				<key>sha256_hash</key>
				<string>56f5cbd162b1c5279b453d6c50b410e78d7570f31f89cfe8a67a52d016f4fafc</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
