<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Rhinoceros 7 and imports it into Munki. This recipe is based on com.github.dataJAR-recipes.munki.Rhinoceros 7 and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.Rhinoceros7</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/rhinoceros</string>
		<key>NAME</key>
		<string>app_rhino7</string>
		<key>SEARCH_URL</key>
		<string>https://files.mcneel.com/rhino/7/mac/updates/commercialUpdates.xml</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Rhino 7</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Rhino can create, edit, analyze, document, render, animate, and translate NURBS curves, surfaces, and solids, point clouds, and polygon meshes.</string>
			<key>category</key>
			<string>Graphics and design</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Grafik und Design</string>
					<key>description</key>
					<string>Rhino kann NURBS-Kurven, -Flächen und -Volumenkörper, Punktwolken und Polygonnetze erstellen, bearbeiten, analysieren, dokumentieren, rendern, animieren und übersetzen.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Robert McNeel &amp; Associates</string>
			<key>display_name</key>
			<string>Rhinoceros 7</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Rhinoceros 7</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.download.Rhinoceros 7</key>
			<dict>
				<key>git_hash</key>
				<string>dcedbeab309d821dbe304b44bd4f4171a0646d0c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Rhinoceros 7/Rhinoceros 7.download.recipe</string>
				<key>sha256_hash</key>
				<string>4a6775f4bbaa9d9177dd98320ed1889ece51145d3cd761c359c3ab9bf4b915f9</string>
			</dict>
			<key>com.github.dataJAR-recipes.munki.Rhinoceros 7</key>
			<dict>
				<key>git_hash</key>
				<string>dcedbeab309d821dbe304b44bd4f4171a0646d0c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Rhinoceros 7/Rhinoceros 7.munki.recipe</string>
				<key>sha256_hash</key>
				<string>d553a4503545f10b77da7fd79ec4314e567071703b3b34d2c461a38f4ae1afef</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
