<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest 'Slack' and imports it into Munki. This recipe is based on com.github.killahquam.munki.slack and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.slack</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/slack</string>
		<key>NAME</key>
		<string>app_slack</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Social Media</string>
			<key>description</key>
			<string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
			<key>developer</key>
			<string>Slack</string>
			<key>display_name</key>
			<string>Slack</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Soziale Netze</string>
					<key>description</key>
					<string>Slack ist eine Plattform für die Teamkommunikation: alles an einem Ort, sofort durchsuchbar, überall verfügbar.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Check for existing users except generic user "Shared"
for USER in `find /Users -type d -mindepth 1 -maxdepth 1 -not -path '*/\.*' -not -path '*/Shared' -not -path '*/Deleted Users' | cut -d/ -f3-`
do
    echo Processing $USER
    SLACK-PLIST='/Users/$USER/Library/Preferences/com.tinyspeck.slackmacgap.plist'
    if [ -f "${SLACK-PLIST}" ]; then
       sudo -u ${USER} defaults write "${SLACK-PLIST}" SlackNoAutoUpdates -bool YES
       echo Suppressed Slack AutoUpdate
    fi
done
exit 0
</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.killahquam.munki.slack</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.killahquam.download.slack</key>
			<dict>
				<key>git_hash</key>
				<string>b92ae9dd0c3dfd847be0d2f9bbd9cd9c3de454e0</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/Slack/Slack.download.recipe</string>
				<key>sha256_hash</key>
				<string>c18640260720b4320bbe2cf8078f77165f2320b998ece74e7646a24c45e46cc5</string>
			</dict>
			<key>com.github.killahquam.munki.slack</key>
			<dict>
				<key>git_hash</key>
				<string>4498bc796d2a730236fee65af03ab6eca8ebe140</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.killahquam-recipes/Slack/Slack.munki.recipe</string>
				<key>sha256_hash</key>
				<string>92700fc3d44b37f2017bfe6e32c5634d9c681bc5ed84dfa329fa5e993624baf2</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
