<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest 'Slack' and imports it into Munki.

This recipe is based on com.github.killahquam.munki.slack and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.slack</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/slack</string>
		<key>NAME</key>
		<string>app_slack</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Social Media</string>
			<key>description</key>
			<string>Slack is a cloud-based set of proprietary team collaboration tools and services, founded by Stewart Butterfield. Slack began as an internal tool used by their company, Tiny Speck, in the development of Glitch, a now defunct online game.</string>
			<key>developer</key>
			<string>Slack</string>
			<key>display_name</key>
			<string>Slack</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Soziale Netze</string>
					<key>description</key>
					<string>Slack ist ein webbasierter Instant-Messaging-Dienst des US-amerikanischen Unternehmens Slack Technologies zur Kommunikation innerhalb von Arbeitsgruppen.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Check for existing users except generic user "Shared"
for USER in `find /Users -type d -mindepth 1 -maxdepth 1 -not -path '*/\.*' -not -path '*/Shared' -not -path '*/Deleted Users' | cut -d/ -f3-`
do
    echo Processing $USER
    SLACK-PLIST='/Users/$USER/Library/Preferences/com.tinyspeck.slackmacgap.plist'
    if [ -f "${SLACK-PLIST}" ]; then
       sudo -u ${USER} defaults write "${SLACK-PLIST}" SlackNoAutoUpdates -bool YES
       echo Suppressed Slack AutoUpdate
    fi
done
exit 0
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.killahquam.munki.slack</string>
</dict>
</plist>
