<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Mactracker and imports into Munki. This recipe is based on com.github.arubdesu.munki.Mactracker and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.override.mactracker</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/ianpage</string>
		<key>NAME</key>
        <string>app_mactracker</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Mactracker provides detailed information on every Apple Macintosh computer ever made, including items such as processor speed, memory, optical drives, graphic cards, supported OS versions, and expansion options. Also included is information on Apple mice, keyboards, displays, printers, scanners, speakers, cameras, iPod, Apple TV, iPhone, iPad, Wi-Fi products, Newton, iOS, Mac OS, and OS X versions.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Dienstprogramme</string>
					<key>description</key>
					<string>Mactracker bietet detaillierte Informationen zu jedem Apple Macintosh, iPod, iPhone und iPad, die jemals hergestellt wurden, einschließlich Angaben zu Prozessorgeschwindigkeit, Speicher, Grafikkarten, unterstützten Betriebssystemversionen, Preis, Speicher und Erweiterungsoptionen. Ebenfalls enthalten sind frühe Apple-Systeme, Newton, Apple TV, Apple Watch, Apple Zubehör, Displays, Drucker, Scanner, Wi-Fi-Produkte und Betriebssysteme.</string>
				</dict>
			</dict>
			<key>display_name</key>
			<string>Mactracker</string>
			<key>developer</key>
			<string>Ian Page</string>
 			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.arubdesu.munki.Mactracker</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.arubdesu.download.Mactracker</key>
			<dict>
				<key>git_hash</key>
				<string>b4fbbf056b087deefbfb8c47447cf3a4a68dee35</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.wycomco.arubdesu-recipes/Mactracker/Mactracker.download.recipe</string>
				<key>sha256_hash</key>
				<string>4bcb2b619816010e6f45247b056e18d7bc61e8430766e1b4bce384699215e010</string>
			</dict>
			<key>com.github.arubdesu.munki.Mactracker</key>
			<dict>
				<key>git_hash</key>
				<string>03369776198203963d157206cb8c9136b2ad759e</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.wycomco.arubdesu-recipes/Mactracker/Mactracker.munki.recipe</string>
				<key>sha256_hash</key>
				<string>556dd969301ba300779d90e10ff0d13df7a5d8ac5b40a904b411ba8e4220f4c6</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
