<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports latest version of Viscosity into a Munki repo. This recipe is based on com.github.jessepeterson.Viscosity.munki and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.viscosity</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/sparklabs</string>
		<key>NAME</key>
		<string>app_viscosity</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Viscosity is a first class OpenVPN client that lets you secure your network with ease &amp; style.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Viscosity ist ein erstklassiger OpenVPN-Client, der dich dein Netzwerk elegant und einfach absichern lässt.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>SparkLabs</string>
			<key>display_name</key>
			<string>Viscosity</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.Viscosity.munki</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.jessepeterson.Viscosity.download</key>
			<dict>
				<key>git_hash</key>
				<string>790b89fd6657efdab953a853d40a023c7551f2d4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jessepeterson-recipes/SparkLabs/Viscosity.download.recipe</string>
				<key>sha256_hash</key>
				<string>caf2b95ad2f5a9d6a0e644f5d82c97633375202e55b18a46e32e9fcfefa60eca</string>
			</dict>
			<key>com.github.jessepeterson.Viscosity.munki</key>
			<dict>
				<key>git_hash</key>
				<string>790b89fd6657efdab953a853d40a023c7551f2d4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.jessepeterson-recipes/SparkLabs/Viscosity.munki.recipe</string>
				<key>sha256_hash</key>
				<string>49f402c6e05bdcd894f4a5fccbb1aef6ca00fc7696e5d380224abad9051d21f5</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
