<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Epic Games Launcher and imports it into Munki. This recipe is based on com.github.n8felton.munki.EpicGamesLauncher and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.EpicGamesLauncher</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/epic</string>
		<key>NAME</key>
		<string>app_epicgameslauncher</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>The Epic Games Launcher is used to download and launch binary versions of the Unreal Engine 4 (as opposed to the engine source code from GitHub), as well as serve as a location to download additional content and view news and blog posts.</string>
			<key>developer</key>
			<string>Epic Games, Inc.</string>
			<key>display_name</key>
			<string>Epic Games Launcher</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Der Epic Games Launcher wird zum Herunterladen und Starten von Binärversionen der Unreal Engine 4 (im Gegensatz zum Engine-Quellcode von GitHub) sowie zum Herunterladen zusätzlicher Inhalte und zum Anzeigen von Nachrichten und Blog-Posts verwendet.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.munki.EpicGamesLauncher</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.n8felton.download.EpicGamesLauncher</key>
			<dict>
				<key>git_hash</key>
				<string>a5be0ac4bd76fc074940fc1279668e8734a54b98</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.n8felton-recipes/EpicGames/Epic Games Launcher.download.recipe</string>
				<key>sha256_hash</key>
				<string>c77d0a3f1a609648090635608baf439197809c7318063adacc1caf2df66d5670</string>
			</dict>
			<key>com.github.n8felton.munki.EpicGamesLauncher</key>
			<dict>
				<key>git_hash</key>
				<string>a5be0ac4bd76fc074940fc1279668e8734a54b98</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.n8felton-recipes/EpicGames/Epic Games Launcher.munki.recipe</string>
				<key>sha256_hash</key>
				<string>971f2a4777bb747719dd6f225ad3f178b7c8255c1836d59bf8e349c76bbc27b1</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
