<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Firefox ESR disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.firefox-rc-en_US and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.firefox-esr-de</string>
	<key>Input</key>
	<dict>
		<key>LOCALE</key>
		<string>de</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/mozilla/firefox</string>
		<key>NAME</key>
		<string>app_firefox_esr</string>
		<key>RELEASE</key>
		<string>esr-latest</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Mozilla Firefox is a free and open source web browser. This is the German ESR version.</string>
			<key>display_name</key>
			<string>Mozilla Firefox ESR</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Mozilla Firefox ist ein freier Open-Source-Webbrowser. Dies ist die ESR-Version.</string>
				</dict>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.firefox-rc-en_US</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>MozillaURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>92758e3756ac9f090e69531b0821ebf1842c899c</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/MozillaURLProvider.py</string>
				<key>sha256_hash</key>
				<string>9f9ae9a7416e59067ba92dde475b925595daa9ac436e82467e1b97bacbb6856b</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.firefox-rc-en_US</key>
			<dict>
				<key>git_hash</key>
				<string>00f9b0ea8aa77716c0875f9aff6f1281cbf8d84d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Firefox.download.recipe</string>
				<key>sha256_hash</key>
				<string>6d17ddeb226c88af7b4bdef7f981634f2da18403e0ebb86afeb5cfbdf4dc5237</string>
			</dict>
			<key>com.github.autopkg.munki.firefox-rc-en_US</key>
			<dict>
				<key>git_hash</key>
				<string>b8ebd97b7fc92cc4a9dc382ccc2ff8090c1b8f21</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Mozilla/Firefox.munki.recipe</string>
				<key>sha256_hash</key>
				<string>3c0f6aa5c32194c854a6ff406525c603ffa5e33776d2509f574a7651fed3967d</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
