<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Google Chrome disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.google-chrome and customized by wycomco (https://www.wycomco.de) to support a different naming convention and German and English locales.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.google-chrome</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_googlechrome</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/google/chrome</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Chrome is a fast, simple, and secure web browser, built for the modern web.</string>
			<key>category</key>
			<string>Productivity</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Chrome ist ein schneller, einfacher und sicherer Webbrowser, der für das moderne Web entwickelt wurde.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Chrome</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.google-chrome</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>90342b929ae491c3d5e12065c30c321c121a70c6</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe</string>
				<key>sha256_hash</key>
				<string>1a3ee2c631c7fe7bfbf341cd4c06312e8e3afffea907d6351a029d8dcd30375e</string>
			</dict>
			<key>com.github.autopkg.munki.google-chrome</key>
			<dict>
				<key>git_hash</key>
				<string>5f5db38265797f1754def56335de7bfc75811305</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.munki.recipe</string>
				<key>sha256_hash</key>
				<string>8fd2feaa1c196109ee3bc4149b2447936782336f913c39875a4ad6c3e6dc4baa</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
