<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Google Chat and imports into Munki. This recipe is based on com.github.homebysix.munki.GoogleChat and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.GoogleChat</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Social Media</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/google/chat</string>
		<key>NAME</key>
		<string>app_googlechat</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Desktop app for the redesigned Google Hangouts Chat service.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Desktop-App für das erneuerte Google Hangouts, jetzt "Chat" genannt.</string>
					<key>category</key>
					<string>Soziale Netze</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Google, Inc.</string>
			<key>display_name</key>
			<string>Chat</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.GoogleChat</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.GoogleChat</key>
			<dict>
				<key>git_hash</key>
				<string>9b0234d95b80ae32897d954ef507d569599a6918</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Google/GoogleChat.download.recipe</string>
				<key>sha256_hash</key>
				<string>af5e4a5c56ebd46d7a5227c8098e54312fb58785999afe25486ce792f1214a7f</string>
			</dict>
			<key>com.github.homebysix.munki.GoogleChat</key>
			<dict>
				<key>git_hash</key>
				<string>9ec625abc0fca6894094438597de829407aea4c0</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Google/GoogleChat.munki.recipe</string>
				<key>sha256_hash</key>
				<string>7acda60a1c0c96f112a2e369c842d77432d38231d17da4220e9e88f9d24292a8</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
