<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Earth Pro disk image and imports into Munki. This recipe is based on com.github.autopkg.nmcspadden-recipes.munki.google-earth-pro and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.override.google-earth-pro</string>
	<key>Input</key>
	<dict>
        <key>NAME</key>
        <string>app_googleearthpro</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/google/earthpro</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Education</string>
			<key>description</key>
			<string>Take a virtual journey to any location in the world. Explore 3D buildings, imagery, and terrain. Find cities, places and local businesses.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Bildung</string>
					<key>description</key>
					<string>Unternehme eine virtuelle Reise an jeden Ort der Welt. Erkunde 3D-Gebäude, Bilder und Gelände. Finde Städte, Orte und Geschäfte.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Earth Pro</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.nmcspadden-recipes.munki.google-earth-pro</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.nmcspadden-recipes.download.google-earth-pro</key>
			<dict>
				<key>git_hash</key>
				<string>942dc7fc94f970553a0530db0b01fe5adbc17980</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.nmcspadden-recipes/GoogleEarthPro/GoogleEarthPro.download.recipe</string>
				<key>sha256_hash</key>
				<string>6d74b706929a332bbad1b63e8d9f6e7a0554bc5311860f2c60b211089c5f6c90</string>
			</dict>
			<key>com.github.autopkg.nmcspadden-recipes.munki.google-earth-pro</key>
			<dict>
				<key>git_hash</key>
				<string>899d6b1de1f965509536eff05fe7f31e53cc6b97</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.nmcspadden-recipes/GoogleEarthPro/GoogleEarthPro.munki.recipe</string>
				<key>sha256_hash</key>
				<string>91a8e4e077665ddd25c5dc5c56b9b87f8088347d72321cd1cf8ed5a86bd13309</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
