<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Spotify and imports into Munki. This recipe is based on com.github.autopkg.munki.Spotify and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.Spotify</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/spotify</string>
		<key>NAME</key>
		<string>app_spotify</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Music</string>
			<key>description</key>
			<string>Spotify is a music streaming service offering unlimited streaming of selected music from a range of major and independent record labels.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Spotify ist ein Musik-Streaming-Dienst, der unbegrenztes Streaming von ausgewählter Musik einer Reihe von Major- und Independent-Plattenlabels anbietet.</string>
					<key>category</key>
					<string>Musik</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Spotify</string>
			<key>display_name</key>
			<string>Spotify</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Spotify</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.Spotify</key>
			<dict>
				<key>git_hash</key>
				<string>4f69d86d0d09b299d47b0f0197a03d97a67ad4ef</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Spotify/Spotify.download.recipe</string>
				<key>sha256_hash</key>
				<string>71b0fbf50f45a1b55b1cb483811bd129c590bc37e1bbed17defd1ad5609f5169</string>
			</dict>
			<key>com.github.autopkg.munki.Spotify</key>
			<dict>
				<key>git_hash</key>
				<string>e77d8193751dd3969b7d960139deb230a8008282</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/Spotify/Spotify.munki.recipe</string>
				<key>sha256_hash</key>
				<string>07138fa4cbdd3e9f2a13765105722d375bb3257365c94a177dba7c63a60fe14b</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
