<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Reader DC and imports it to Munki. This recipe is based on com.github.autopkg.munki.AdobeReaderDC and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.AdobeReaderDC</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>German</string>
		<key>MAJOR_VERSION</key>
		<string>AcrobatDC</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/adobe/adobereader</string>
		<key>NAME</key>
		<string>app_adobereaderdc</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Reader.app</string>
				<string>Adobe Acrobat Reader DC.app</string>
				<string>Adobe Acrobat Pro.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>More powerful than other PDF software, Adobe Acrobat Reader DC is the free, trusted standard for viewing, printing, and annotating PDFs. And now, it’s connected to Adobe Document Cloud — so it’s easier than ever to work with PDFs on computers and mobile devices.</string>
			<key>display_name</key>
			<string>Adobe Acrobat Reader DC</string>
			<key>category</key>
			<string>Utilities</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Adobe Acrobat Reader DC ist die Standardlösung für die zuverlässige Anzeige, Druckausgabe und Kommentierung von PDF-Dokumenten. Und dank der Integration mit Adobe Document Cloud vereinfacht die Applikation zudem die Arbeit mit PDFs auf dem Desktop und mobilen Endgeräten.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>minimum_os_version</key>
			<string>10.13.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preinstall_script</key>
			<string>#!/bin/sh
if [ -e "/Applications/Adobe Acrobat Reader DC.app" ]; then
rm -r "/Applications/Adobe Acrobat Reader DC.app"
fi
exit 0
            </string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.AdobeReaderDC</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>AdobeReaderURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>437e573e281a4bd4ceb40ee569fc3e3dd441d0ba</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderURLProvider.py</string>
				<key>sha256_hash</key>
				<string>c2fa5d078493c52e8fe34e8f899ed0590421fffa2d0bbe91a1b6b4f07bbe4498</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.AdobeReaderDC</key>
			<dict>
				<key>git_hash</key>
				<string>536ace04fd947d052ecade6e95c8d1ead81e94fd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderDC.download.recipe</string>
				<key>sha256_hash</key>
				<string>8f991ec006ddb3d43fc7510526989cfb6a2ec3879880e90ccf85a13a83c7d839</string>
			</dict>
			<key>com.github.autopkg.munki.AdobeReaderDC</key>
			<dict>
				<key>git_hash</key>
				<string>e6099c55261ae5bc78f773f9c417c280b3657f34</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/AdobeReader/AdobeReaderDC.munki.recipe</string>
				<key>sha256_hash</key>
				<string>e57974268d396c884ba267a06143cbf0586760754cb6456a640d76fb97faf196</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
