<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads and imports the full installer pkg for Microsoft Excel 365 into Munki
    
	This is accomplished via the Office 365 recipes from rtrouton-recipes.
	
    These in turn, utilise the fwlink's found on macadmins.software
        
    This recipe is based on com.github.dataJAR-recipes.munki.Microsoft Excel 365 and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
    <key>Identifier</key>
    <string>com.github.wycomco.override.MSExcel365</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>app_excel365</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/microsoft/office365</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Auto Update</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft Excel</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Sehen Sie Ihre Daten auf neue, intuitive Weise. Leistungsfähige Diagramme, Graphen und Tastenkombinationen machen aus Zahlenspalten wertvolle Informationen, damit Sie einfacher arbeiten können.</string>
				</dict>
			</dict>
			<key>description</key>
			<string>See your data in new, intuitive ways. Powerful charts, graphs, and keyboard shortcuts turn columns of numbers into valuable information, so you can work easier.</string>
			<key>display_name</key>
			<string>Microsoft Excel</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/sh
if [ -d "/Library/Application Support/Microsoft/MAU2.0" ]; then
   launchctl remove com.microsoft.autoupdate.helper
   launchctl remove com.microsoft.update.agent
   rm -f /Library/PrivilegedHelperTools/com.microsoft.autoupdate.helper
   rm -f /Library/LaunchAgents/com.microsoft.update.agent.plist
   rm -f /Library/LaunchDaemons/com.microsoft.autoupdate.helper.plist
   rm -rf /Library/Application\ Support/Microsoft/MAU2.0/
   pkgutil --forget com.microsoft.autoupdate2
   pkgutil --forget com.microsoft.package.Microsoft_AutoUpdate.app
   echo "Removed Microsoft AutoUpdate"
fi

exit 0</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Microsoft Excel 365</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.munki.Microsoft Excel 365</key>
			<dict>
				<key>git_hash</key>
				<string>7c05f97f6326f5c13c21738f8e5d440eb270a744</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Microsoft Excel 365/Microsoft Excel 365.munki.recipe</string>
				<key>sha256_hash</key>
				<string>f6fb2ea86f2d53e5f25e9936c7c716506c2be625f3b60c1d8428b8e8b0e2ae71</string>
			</dict>
			<key>com.github.rtrouton.download.microsoftexcel365</key>
			<dict>
				<key>git_hash</key>
				<string>8a29db2944790f4a29cc98618e0d2e87c96668d5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftExcel365/MicrosoftExcel365.download.recipe</string>
				<key>sha256_hash</key>
				<string>0cce58fb09aed964c58e59288abbb5c0bb9d5e14702dc1c6cf1c0d08a51be31e</string>
			</dict>
			<key>com.github.rtrouton.pkg.microsoftexcel365</key>
			<dict>
				<key>git_hash</key>
				<string>8a29db2944790f4a29cc98618e0d2e87c96668d5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftExcel365/MicrosoftExcel365.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>adb5b2a1440587ba36ed80d21c1f26a3d718b3545ead24dbb34a2eeb633712b8</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
