<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads and imports the full installer pkg for Microsoft OneNote 365 into Munki

	This is accomplished via the Office 365 recipes from rtrouton-recipes.

    These in turn, utilise the fwlink's found on macadmins.software

    This recipe is based on com.github.dataJAR-recipes.munki.Microsoft OneNote 365 and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
    <key>Identifier</key>
    <string>com.github.wycomco.override.MSOneNote365</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>app_onenote365</string>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/microsoft/office365</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Auto Update</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft OneNote</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Ihre Welt, organisiert. Ordnen Sie sich in Notizbüchern an, die Sie in Abschnitte und Seiten unterteilen können. Mit der einfachen Navigation und Suche finden Sie Ihre Notizen immer dort, wo Sie sie hinterlassen haben.</string>
				</dict>
			</dict>
			<key>description</key>
			<string>Your world, organized. Get organized in notebooks you can divide into sections and pages. With easy navigation and search, you’ll always find your notes right where you left them.</string>
			<key>display_name</key>
			<string>Microsoft OneNote</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/sh
if [ -d "/Library/Application Support/Microsoft/MAU2.0" ]; then
   launchctl remove com.microsoft.autoupdate.helper
   launchctl remove com.microsoft.update.agent
   rm -f /Library/PrivilegedHelperTools/com.microsoft.autoupdate.helper
   rm -f /Library/LaunchAgents/com.microsoft.update.agent.plist
   rm -f /Library/LaunchDaemons/com.microsoft.autoupdate.helper.plist
   rm -rf /Library/Application\ Support/Microsoft/MAU2.0/
   pkgutil --forget com.microsoft.autoupdate2
   pkgutil --forget com.microsoft.package.Microsoft_AutoUpdate.app
   echo "Removed Microsoft AutoUpdate"
fi

exit 0</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Microsoft OneNote 365</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.munki.Microsoft OneNote 365</key>
			<dict>
				<key>git_hash</key>
				<string>9e62b6fbd6109e34b050b7c88274e684e8c81785</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Microsoft OneNote 365/Microsoft OneNote 365.munki.recipe</string>
				<key>sha256_hash</key>
				<string>d8cd088616263dd8a0877b4f4f5bf52aa25604dc904a4bfd97761c114adb5d7e</string>
			</dict>
			<key>com.github.rtrouton.download.microsoftonenote365</key>
			<dict>
				<key>git_hash</key>
				<string>8a29db2944790f4a29cc98618e0d2e87c96668d5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftOneNote365/MicrosoftOneNote365.download.recipe</string>
				<key>sha256_hash</key>
				<string>a60cad6107c758ea36cda01540115384839dcffd3bc65189c37ae09bbf820357</string>
			</dict>
			<key>com.github.rtrouton.pkg.microsoftonenote365</key>
			<dict>
				<key>git_hash</key>
				<string>8a29db2944790f4a29cc98618e0d2e87c96668d5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftOneNote365/MicrosoftOneNote365.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>ca49bdbfeadd303c7161ded60808cfa595d6482f0d9026ac48cc0dbf2b4d39ac</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
