<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Microsoft Teams and imports it into Munki. This recipe is based on com.github.apettinen.munki.MSTeams and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.MSTeams</string>
	<key>Input</key>
	<dict>
		<key>DISPLAY_NAME</key>
		<string>Microsoft Teams</string>
		<key>MSTEAMS_ENVIRONMENT</key>
		<string>production</string>
		<key>MSTEAMS_PLATFORM</key>
		<string>osx</string>
		<key>MUNKI_CATEGORY</key>
		<string>Social Media</string>
		<key>MUNKI_DESCRIPTION</key>
		<string>Microsoft Teams is the new chat-centered workspace in Office 365. Keep all your content, tools, people, and conversations together in one place.</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Microsoft</string>
		<key>MUNKI_NAME</key>
		<string>app_teams</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/microsoft/office365</string>
		<key>NAME</key>
		<string>MSTeams</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>%MUNKI_DESCRIPTION%</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Soziale Netze</string>
					<key>description</key>
					<string>Microsoft Teams ist die chat-basierte Arbeitsfläche in Office 365. Behalte all deine Inhalte, Werkzeuge, Menschen und Nachrichten zusammen an einem Platz.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
			<key>name</key>
			<string>%MUNKI_NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.apettinen.munki.MSTeams</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.apettinen.SharedProcessors/MSTeamsURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>9480a43b9ade95c56e1f349c9cbecd560f33d3fe</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.apettinen-recipes/SharedProcessors/MSTeamsURLProvider.py</string>
				<key>sha256_hash</key>
				<string>adcc1e8eb5152ea0ad0aa74567df57b3362a4bfa723bd10c0acf565196975bca</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.apettinen.download.MSTeams</key>
			<dict>
				<key>git_hash</key>
				<string>dafcd6a39ba45e02d80147c25c6881636828f856</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.apettinen-recipes/MSTeams/MSTeams.download.recipe</string>
				<key>sha256_hash</key>
				<string>c5e919de410a9142086e2e4578c0a564ffe91b06d239576812db6b36207da6f4</string>
			</dict>
			<key>com.github.apettinen.munki.MSTeams</key>
			<dict>
				<key>git_hash</key>
				<string>c6557d60a0968242db623740d3f87d99c7a3ccc0</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.apettinen-recipes/MSTeams/MSTeams.munki.recipe</string>
				<key>sha256_hash</key>
				<string>2e343ebfb31379785125bb5e7a0447dd07b54e55964b1b93a313fc2e48f8843c</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
