<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>This recipe downloads and imports the full installer pkg for Microsoft Word 365 into Munki

	This is accomplished via the Office 365 recipes from rtrouton-recipes.

    These in turn, utilise the fwlink's found on macadmins.software

    This recipe is based on com.github.dataJAR-recipes.munki.Microsoft Word 365 and customized by wycomco (https://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.MSWord365</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/microsoft/office365</string>
		<key>NAME</key>
		<string>app_word365</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Auto Update</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft Word</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>The Word you want. State-of-the-art editing, reviewing, and sharing tools make creating and polishing documents easy.</string>
			<key>display_name</key>
			<string>Microsoft Word</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Das Word, das Sie wollen. Modernste Werkzeuge zum Bearbeiten, Überprüfen und Freigeben machen das Erstellen und Überarbeiten von Dokumenten einfach.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Microsoft Word 365</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.dataJAR-recipes.munki.Microsoft Word 365</key>
			<dict>
				<key>git_hash</key>
				<string>cf581699a2aaf48ec423a25e7fb90ec7098311fe</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.dataJAR-recipes/Microsoft Word 365/Microsoft Word 365.munki.recipe</string>
				<key>sha256_hash</key>
				<string>5b9f7b26a0b84d56e12fb8b3388bb75fb111a1f4a3dbb1d56d209129ce85e753</string>
			</dict>
			<key>com.github.rtrouton.download.microsoftword365</key>
			<dict>
				<key>git_hash</key>
				<string>8a29db2944790f4a29cc98618e0d2e87c96668d5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftWord365/MicrosoftWord365.download.recipe</string>
				<key>sha256_hash</key>
				<string>447da48064a925c65307413ae32c76a665d633f0ccf9ad7f53d0de1809441c1c</string>
			</dict>
			<key>com.github.rtrouton.pkg.microsoftword365</key>
			<dict>
				<key>git_hash</key>
				<string>90f11cb9012473899a2640d445553ebbe86882a6</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/MicrosoftWord365/MicrosoftWord365.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>da3f07d80e6bab3f8f5ac19c80706cae87909d57bd63e3c4ec1d474eedb75b59</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
