<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v0.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Tunnelblick and imports it into Munki.

This recipe is based on com.github.homebysix.munki.Tunnelblick and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.Tunnelblick</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/tunnelblick</string>
		<key>NAME</key>
		<string>app_tunnelblick</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Tunnelblick is a free, open source graphic user interface for OpenVPN on OS X and macOS.</string>
			<key>category</key>
			<string>Utilities</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Die Kostenlos-App Tunnelblick ist ein praktischer, einfacher OpenVPN-Client für Ihren Mac.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>The Tunnelblick Project</string>
			<key>display_name</key>
			<string>Tunnelblick</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh
# based on forum discussion:
# https://groups.google.com/forum/#!topic/tunnelblick-discuss/UYeR7vv_rXM

# setup folders and secure Tunnelblick app
/Applications/Tunnelblick.app/Contents/Resources/installer 5

# secure configurations
/Applications/Tunnelblick.app/Contents/Resources/installer 16

# disable auto update
defaults write "/Library/Application Support/Tunnelblick/forced-preferences" updateCheckAutomatically FALSE
chmod 644 "/Library/Application Support/Tunnelblick/forced-preferences.plist"
			</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.Tunnelblick</string>
</dict>
</plist>
