<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest TrelloX disk image and imports into Munki.

This recipe is based on com.github.clburlison.munki.trellox and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.override.trellox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>app_trellox</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/trellox</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
			<key>category</key>
			<string>Productivity</string>
            <key>description</key>
            <string>An Unofficial Trello App for Mac OS X.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Inoffizielle Desktop-App für Trello.</string>
				</dict>
			</dict>
            <key>display_name</key>
            <string>TrelloX (Xccello)</string>
        	<key>minimum_os_version</key>
            <string>10.8.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.clburlison.munki.trellox</string>
</dict>
</plist>
